In [111]:
import pandas as pd
import numpy as np 
import datetime 
pd.options.mode.chained_assignment = None  # default='warn'

data_url = '/home/van/Desktop/pandas_scipy_2020/pandas_mau/data'

## Columns containing values, not variable

In [37]:
pew = pd.read_csv('/home/van/Desktop/pandas_scipy_2020/pandas_mau/data/pew.csv')
pew.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

In [16]:
# the above data is not tidy need to use melt to bring var to row
# id_vars is a para help to remain col unchange
# notice that we want religion unchange all other col will drop into 
# 2 row 1 contains var name 1 contains its values
pew.melt(id_vars='religion')

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [20]:
# change variable name into income and value into count
pew_tidy = pew.melt(id_vars='religion',value_name='count', var_name='income')
pew_tidy.head()

             religion income  count
0            Agnostic  <$10k     27
1             Atheist  <$10k     12
2            Buddhist  <$10k     27
3            Catholic  <$10k    418
4  Don’t know/refused  <$10k     15

In [23]:
# these all do the same thing
pew_tidy.groupby(by='income')['count'].sum()
pew_tidy.groupby(by='income')['count'].agg('sum')

pew_tidy.groupby(by='income')['count'].agg(np.sum)

income
$10-20k               2781
$100-150k             3197
$20-30k               3357
$30-40k               3302
$40-50k               3085
$50-75k               5185
$75-100k              3990
<$10k                 1930
>150k                 2608
Don't know/refused    6121
Name: count, dtype: int64

In [52]:
d_parser = lambda x: datetime.datetime.strptime(x,'%Y-%m-%d')
billboard = pd.read_csv('/home/van/Desktop/pandas_scipy_2020/pandas_mau/data/billboard.csv',
                       parse_dates=['date.entered'],date_parser=d_parser)
billboard.head()

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
billboard_melt = (billboard.melt(
                                id_vars=['year','artist','track','time','date.entered'],
                                value_name='rank',
                                var_name='week'))
billboard_melt.head()

   year        artist                    track  time date.entered week  rank
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk1  87.0
1  2000       2Ge+her  The Hardest Part Of ...  3:15   2000-09-02  wk1  91.0
2  2000  3 Doors Down               Kryptonite  3:53   2000-04-08  wk1  81.0
3  2000  3 Doors Down                    Loser  4:24   2000-10-21  wk1  76.0
4  2000      504 Boyz            Wobble Wobble  3:35   2000-04-15  wk1  57.0

In [58]:
# format week col to int type
billboard_melt['week'] = (billboard_melt['week']
                        .apply(lambda x: x.replace('wk',''))
                        .astype('int'))

In [59]:
billboard_melt['week'].head()

0    1
1    1
2    1
3    1
4    1
Name: week, dtype: int64

In [60]:
billboard_melt.head()

   year        artist                    track  time date.entered  week  rank
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26     1  87.0
1  2000       2Ge+her  The Hardest Part Of ...  3:15   2000-09-02     1  91.0
2  2000  3 Doors Down               Kryptonite  3:53   2000-04-08     1  81.0
3  2000  3 Doors Down                    Loser  4:24   2000-10-21     1  76.0
4  2000      504 Boyz            Wobble Wobble  3:35   2000-04-15     1  57.0

In [61]:
billboard_melt.groupby(by='artist')['rank'].mean()

artist
2 Pac               85.428571
2Ge+her             90.000000
3 Doors Down        37.602740
504 Boyz            56.222222
98^0                37.650000
                      ...
Yankee Grey         83.125000
Yearwood, Trisha    84.166667
Ying Yang Twins     88.857143
Zombie Nation       99.000000
matchbox twenty     18.641026
Name: rank, Length: 228, dtype: float64

## Cols contain multiple vars

In [138]:
d_parser = lambda x: datetime.datetime.strptime(x,'%m/%d/%Y')
ebola = pd.read_csv('/home/van/Desktop/pandas_scipy_2020/pandas_mau/data/country_timeseries.csv',
                   parse_dates=['Date'],date_parser=d_parser)
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [165]:
# notice that cd_country is cases and deaths country
# beacuse of melt droping (drop into 2 rows: col row, and their values)
ebola_long = (ebola
              .melt(id_vars=['Date','Day']
                    ,var_name='cd_country'
                    ,value_name='count'))
ebola_long.head()

        Date  Day    cd_country   count
0 2015-01-05  289  Cases_Guinea  2776.0
1 2015-01-04  288  Cases_Guinea  2775.0
2 2015-01-03  287  Cases_Guinea  2769.0
3 2015-01-02  286  Cases_Guinea     NaN
4 2014-12-31  284  Cases_Guinea  2730.0

In [166]:
filt_1 = ebola_long['cd_country'].str.contains('Cases')

### Create dataset for Cases

In [167]:
# filter count with cases_ prefix only
cases_dataset = ebola_long.loc[filt_1]
cases_dataset.head()

        Date  Day    cd_country   count
0 2015-01-05  289  Cases_Guinea  2776.0
1 2015-01-04  288  Cases_Guinea  2775.0
2 2015-01-03  287  Cases_Guinea  2769.0
3 2015-01-02  286  Cases_Guinea     NaN
4 2014-12-31  284  Cases_Guinea  2730.0

In [168]:
# make sure cd_country contains all cases
cases_dataset['cd_country'].value_counts()

Cases_Spain           122
Cases_Liberia         122
Cases_Guinea          122
Cases_Nigeria         122
Cases_Mali            122
Cases_UnitedStates    122
Cases_SierraLeone     122
Cases_Senegal         122
Name: cd_country, dtype: int64

In [170]:
country = cases_dataset['cd_country'].apply(lambda x: x.split('_')[1])

In [171]:
cases_dataset.loc[:,'country'] = country

In [172]:
cases_dataset.drop('cd_country',axis=1, inplace=True)

In [173]:
# col reorder
cases_dataset.rename(columns={'count':'cases'},inplace=True)
cases_dataset = cases_dataset[['Date','Day','country','cases']]
cases_dataset.head()

        Date  Day country   cases
0 2015-01-05  289  Guinea  2776.0
1 2015-01-04  288  Guinea  2775.0
2 2015-01-03  287  Guinea  2769.0
3 2015-01-02  286  Guinea     NaN
4 2014-12-31  284  Guinea  2730.0

### Create dataset for deaths

In [143]:
filt_2 = ebola_long['cd_country'].str.contains('Deaths')

In [146]:
death_dataset = ebola_long.loc[filt_2]
death_dataset.head()

          Date  Day     cd_country   count
976 2015-01-05  289  Deaths_Guinea  1786.0
977 2015-01-04  288  Deaths_Guinea  1781.0
978 2015-01-03  287  Deaths_Guinea  1767.0
979 2015-01-02  286  Deaths_Guinea     NaN
980 2014-12-31  284  Deaths_Guinea  1739.0

In [149]:
death_dataset['cd_country'].value_counts()

Deaths_SierraLeone     122
Deaths_Spain           122
Deaths_Mali            122
Deaths_UnitedStates    122
Deaths_Nigeria         122
Deaths_Guinea          122
Deaths_Liberia         122
Deaths_Senegal         122
Name: cd_country, dtype: int64

In [150]:
death = death_dataset['cd_country'].apply(lambda x: x.split('_')[1])

In [151]:
death_dataset.loc[:,'death'] = death

In [152]:
death_dataset.drop('cd_country',axis=1, inplace=True)

In [163]:
death_dataset.rename(columns={'death':'country','cases':'deaths'},inplace=True)
death_dataset.head()

          Date  Day country  deaths
976 2015-01-05  289  Guinea  1786.0
977 2015-01-04  288  Guinea  1781.0
978 2015-01-03  287  Guinea  1767.0
979 2015-01-02  286  Guinea     NaN
980 2014-12-31  284  Guinea  1739.0

In [178]:
# merge death and cases
ebola_tidy = pd.merge(left=cases_dataset,right=death_dataset,how='outer')
ebola_tidy.head()

        Date  Day country   cases  deaths
0 2015-01-05  289  Guinea  2776.0  1786.0
1 2015-01-04  288  Guinea  2775.0  1781.0
2 2015-01-03  287  Guinea  2769.0  1767.0
3 2015-01-02  286  Guinea     NaN     NaN
4 2014-12-31  284  Guinea  2730.0  1739.0

## Vars in cols and in rows

In [197]:
weather = pd.read_csv('/home/van/Desktop/pandas_scipy_2020/pandas_mau/data/weather.csv')
weather.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [198]:
# element is not a vars, it contains 2 vars
# we dropna beacause we know na is value that less than 31 days in month
# easy to put back in
weather_long = weather.melt(id_vars=['id','year','month','element'],var_name='day'
            ,value_name='temp')
weather_long.dropna()

          id  year  month element  day  temp
20   MX17004  2010     12    tmax   d1  29.9
21   MX17004  2010     12    tmin   d1  13.8
24   MX17004  2010      2    tmax   d2  27.3
25   MX17004  2010      2    tmin   d2  14.4
40   MX17004  2010     11    tmax   d2  31.3
..       ...   ...    ...     ...  ...   ...
631  MX17004  2010      8    tmin  d29  15.3
638  MX17004  2010      1    tmax  d30  27.8
639  MX17004  2010      1    tmin  d30  14.5
674  MX17004  2010      8    tmax  d31  25.4
675  MX17004  2010      8    tmin  d31  15.4

[66 rows x 6 columns]

### To solve vars in cols and rows we must use "pivot-table" opposite of melt

In [199]:
weather_tidy = (weather_long
                .pivot_table(index=['id', 'year', 'month', 'day'],
                        columns='element',
                        values='temp')
               )

In [200]:
# return to long table
weather_tidy = weather_tidy.reset_index()
weather_tidy.head()

element       id  year  month  day  tmax  tmin
0        MX17004  2010      1  d30  27.8  14.5
1        MX17004  2010      2  d11  29.7  13.4
2        MX17004  2010      2   d2  27.3  14.4
3        MX17004  2010      2  d23  29.9  10.7
4        MX17004  2010      2   d3  24.1  14.4